katsusand/esp32_project/components/cyd_wifi_setup/cyd_wifi_setup.c
#include <inttypes.h>
#include <stdio.h>
#include <string.h>
#include "freertos/FreeRTOS.h"
#include "freertos/portmacro.h"
#include "freertos/task.h"
#include "esp_check.h"
#include "esp_log.h"
#include "sdkconfig.h"
#include "app_shell.h"
#include "cyd_display.h"
#include "cyd_input.h"
#include "cyd_ui.h"
#include "esp32_wifi_sta.h"
#include "cyd_wifi_setup.h"
#include "time_sync.h"
#include "wifi_manager.h"
#include "wifi_profile_store.h"

#define WIFI_SCAN_STATUS_LINE_COUNT 10
#define WIFI_SCAN_RECORD_CAPACITY CONFIG_ESP32_WIFI_STA_SCAN_LIST_SIZE
#define WIFI_PASSWORD_MAX_LEN   64
#define WIFI_SCREEN_FIRST_LINE_ROW 4
#define WIFI_SCREEN_LINE_HEIGHT_ROWS 2
#define WIFI_KEY_ROW_0          9
#define WIFI_KEY_ROW_1          12
#define WIFI_KEY_ROW_2          15
#define WIFI_KEY_CONTROL_ROW    20
#define WIFI_KEY_BOTTOM_ROW     25
#define WIFI_KEY_HEIGHT_ROWS    2
#define WIFI_CONTROL_HEIGHT_ROWS 3
#define WIFI_BOTTOM_HEIGHT_ROWS 4
#define WIFI_KEY_WIDTH_COLS     4
#define WIFI_BACK_COL           0
#define WIFI_BACK_ROW           0
#define WIFI_BACK_WIDTH_COLS    6
#define WIFI_BACK_HEIGHT_ROWS   3
#define WIFI_TITLE_COL          8
#define WIFI_TITLE_ROW          0
#define WIFI_TITLE_WIDTH_COLS   32
#define WIFI_TITLE_HEIGHT_ROWS  2
#define WIFI_ACTION_SCAN_BASE   0x0100
#define WIFI_ACTION_KEY_BASE    0x0200
#define WIFI_ACTION_LOWER       0x0301
#define WIFI_ACTION_UPPER       0x0302
#define WIFI_ACTION_SYMBOL      0x0303
#define WIFI_ACTION_DELETE      0x0304
#define WIFI_ACTION_SPACE       0x0305
#define WIFI_ACTION_CANCEL      0x0306
#define WIFI_ACTION_SAVE        0x0307
#define WIFI_ACTION_TOGGLE_PASSWORD 0x0308
#define WIFI_ACTION_TOGGLE_CASE 0x0309
#define WIFI_ACTION_SCAN_BACK   0x030a
#define WIFI_ACTION_SCAN_REFRESH 0x030b
#define WIFI_ACTION_SCAN_PREV   0x030c
#define WIFI_ACTION_SCAN_NEXT   0x030d
#define WIFI_IDLE_POLL_MS       250

#ifndef CONFIG_ESP32_WIFI_STA_SSID
#define CONFIG_ESP32_WIFI_STA_SSID ""
#endif
#ifndef CONFIG_ESP32_WIFI_STA_MAX_RETRY
#define CONFIG_ESP32_WIFI_STA_MAX_RETRY 5
#endif
#ifndef CONFIG_ESP32_WIFI_STA_CONNECT_TIMEOUT_MS
#define CONFIG_ESP32_WIFI_STA_CONNECT_TIMEOUT_MS 15000
#endif
#ifndef CONFIG_ESP32_WIFI_STA_SAE_H2E_IDENTIFIER
#define CONFIG_ESP32_WIFI_STA_SAE_H2E_IDENTIFIER ""
#endif

#define TAG "cyd_wifi_setup"

static cyd_display_screen_t s_wifi_setup_screen;
static portMUX_TYPE s_autoconnect_progress_lock = portMUX_INITIALIZER_UNLOCKED;
static cyd_wifi_setup_autoconnect_progress_t s_autoconnect_progress = {
    .phase = CYD_WIFI_SETUP_AUTOCONNECT_IDLE,
};

static void wifi_set_autoconnect_progress(cyd_wifi_setup_autoconnect_phase_t phase, const char *ssid)
{
    portENTER_CRITICAL(&s_autoconnect_progress_lock);
    s_autoconnect_progress.phase = phase;
    if (ssid != NULL) {
        snprintf(s_autoconnect_progress.ssid, sizeof(s_autoconnect_progress.ssid), "%.32s", ssid);
    } else {
        s_autoconnect_progress.ssid[0] = '\0';
    }
    portEXIT_CRITICAL(&s_autoconnect_progress_lock);
}

typedef enum {
    WIFI_KEYBOARD_LOWER = 0,
    WIFI_KEYBOARD_UPPER,
    WIFI_KEYBOARD_SYMBOL,
    WIFI_KEYBOARD_SYMBOL_EXTRA,
} wifi_keyboard_page_t;

typedef enum {
    WIFI_PASSWORD_ACTION_NONE = 0,
    WIFI_PASSWORD_ACTION_CANCEL,
    WIFI_PASSWORD_ACTION_SAVE,
    WIFI_PASSWORD_ACTION_DELETE,
    WIFI_PASSWORD_ACTION_SPACE,
    WIFI_PASSWORD_ACTION_LOWER,
    WIFI_PASSWORD_ACTION_UPPER,
    WIFI_PASSWORD_ACTION_SYMBOL,
    WIFI_PASSWORD_ACTION_TOGGLE_SHOW,
    WIFI_PASSWORD_ACTION_TOGGLE_CASE,
    WIFI_PASSWORD_ACTION_CHAR,
} wifi_password_action_t;

typedef struct {
    wifi_password_action_t action;
    char ch;
} wifi_password_key_t;

typedef struct {
    bool pending;
    bool long_pressed;
    uint16_t action_id;
} wifi_touch_action_tracker_t;

typedef struct {
    bool pending;
    bool long_pressed;
    size_t button_index;
} wifi_touch_mode_button_tracker_t;

typedef struct {
    wifi_profile_store_entry_t profile;
    esp32_wifi_sta_scan_record_t scan_record;
} wifi_saved_candidate_t;

typedef struct {
    bool initialized;
    uint32_t scan_round;
    size_t page_index;
    size_t record_count;
    esp32_wifi_sta_scan_record_t records[WIFI_SCAN_RECORD_CAPACITY];
    size_t visible_count;
    wifi_touch_action_tracker_t touch_tracker;
} wifi_scan_session_t;

typedef struct {
    bool initialized;
    esp32_wifi_sta_scan_record_t record;
    char password[WIFI_PASSWORD_MAX_LEN + 1];
    wifi_keyboard_page_t page;
    bool show_password;
    wifi_touch_action_tracker_t touch_tracker;
} wifi_password_session_t;

static wifi_scan_session_t s_scan_session = { 0 };
static wifi_password_session_t s_password_session = { 0 };
static const app_shell_app_t *s_wifi_setup_return_app;

typedef enum {
    CYD_WIFI_SETUP_APP_MODE_SCAN = 0,
    CYD_WIFI_SETUP_APP_MODE_PASSWORD,
} cyd_wifi_setup_app_mode_t;

typedef struct {
    bool active;
    cyd_wifi_setup_app_mode_t mode;
    esp32_wifi_sta_scan_record_t selected_record;
} cyd_wifi_setup_app_state_t;

static cyd_wifi_setup_app_state_t s_wifi_setup_app_state = { 0 };

static bool wifi_touch_event_confirmed_action(const cyd_input_event_t *event,
                                              wifi_touch_action_tracker_t *tracker,
                                              uint16_t *action_id)
{
    if (event == NULL || tracker == NULL || event->type != CYD_INPUT_EVENT_TOUCH) {
        return false;
    }

    switch (event->data.touch.action) {
        case CYD_INPUT_TOUCH_ACTION_PRESS:
            tracker->pending = cyd_display_hit_test_action(event->data.touch.x,
                                                           event->data.touch.y,
                                                           &tracker->action_id);
            tracker->long_pressed = false;
            return false;
        case CYD_INPUT_TOUCH_ACTION_LONG_PRESS:
        case CYD_INPUT_TOUCH_ACTION_REPEAT:
            if (tracker->pending) {
                tracker->long_pressed = true;
            }
            return false;
        case CYD_INPUT_TOUCH_ACTION_RELEASE: {
            uint16_t release_action_id = 0;
            bool confirmed = tracker->pending &&
                             !tracker->long_pressed &&
                             cyd_display_hit_test_action(event->data.touch.x,
                                                         event->data.touch.y,
                                                         &release_action_id) &&
                             release_action_id == tracker->action_id;
            if (confirmed && action_id != NULL) {
                *action_id = release_action_id;
            }
            tracker->pending = false;
            tracker->long_pressed = false;
            tracker->action_id = 0;
            return confirmed;
        }
        default:
            return false;
    }
}

static bool wifi_touch_event_confirmed_mode_button(const cyd_input_event_t *event,
                                                   wifi_touch_mode_button_tracker_t *tracker,
                                                   size_t *button_index)
{
    if (event == NULL || tracker == NULL || event->type != CYD_INPUT_EVENT_TOUCH) {
        return false;
    }

    switch (event->data.touch.action) {
        case CYD_INPUT_TOUCH_ACTION_PRESS:
            tracker->pending = cyd_display_hit_test_mode_button(event->data.touch.x,
                                                                event->data.touch.y,
                                                                &tracker->button_index);
            tracker->long_pressed = false;
            return false;
        case CYD_INPUT_TOUCH_ACTION_LONG_PRESS:
        case CYD_INPUT_TOUCH_ACTION_REPEAT:
            if (tracker->pending) {
                tracker->long_pressed = true;
            }
            return false;
        case CYD_INPUT_TOUCH_ACTION_RELEASE: {
            size_t release_button_index = 0;
            bool confirmed = tracker->pending &&
                             !tracker->long_pressed &&
                             cyd_display_hit_test_mode_button(event->data.touch.x,
                                                              event->data.touch.y,
                                                              &release_button_index) &&
                             release_button_index == tracker->button_index;
            if (confirmed && button_index != NULL) {
                *button_index = release_button_index;
            }
            tracker->pending = false;
            tracker->long_pressed = false;
            tracker->button_index = 0;
            return confirmed;
        }
        default:
            return false;
    }
}

static void wifi_format_scan_line(char *line, size_t line_size, const esp32_wifi_sta_scan_record_t *record)
{
    snprintf(line,
             line_size,
             "%-24s %4d ch%02u",
             record->ssid,
             record->rssi,
             (unsigned)record->channel);
}

static size_t wifi_scan_session_page_count(const wifi_scan_session_t *session)
{
    if (session == NULL || session->record_count == 0) {
        return 1;
    }
    return (session->record_count + WIFI_SCAN_STATUS_LINE_COUNT - 1) / WIFI_SCAN_STATUS_LINE_COUNT;
}

static void wifi_add_scan_control_button(cyd_display_screen_t *screen,
                                         const char *text,
                                         uint8_t col,
                                         uint16_t action_id,
                                         bool enabled)
{
    cyd_ui_add_button_with_fg_enabled(screen,
                                      text,
                                      col,
                                      26,
                                      12,
                                      3,
                                      CYD_UI_COLOR_WHITE,
                                      CYD_UI_COLOR_BLUE,
                                      CYD_UI_COLOR_CYAN,
                                      action_id,
                                      enabled);
}

