katsusand/esp32_project/components/cyd_wifi_setup/cyd_wifi_setup.c
static esp_err_t wifi_show_scan_screen(const char *title,
                                       esp_err_t scan_ret,
                                       wifi_scan_session_t *session,
                                       bool scanning)
{
    cyd_display_screen_t *screen = &s_wifi_setup_screen;
    char line_storage[WIFI_SCAN_STATUS_LINE_COUNT][CYD_DISPLAY_TEXT_MAX_LEN + 1];
    char title_line[CYD_DISPLAY_TEXT_MAX_LEN + 1] = { 0 };
    size_t page_count = 1;
    size_t first_record = 0;

    ESP_RETURN_ON_FALSE(title != NULL, ESP_ERR_INVALID_ARG, TAG, "title required");
    ESP_RETURN_ON_FALSE(session != NULL, ESP_ERR_INVALID_ARG, TAG, "scan session required");
    session->visible_count = 0;
    page_count = wifi_scan_session_page_count(session);
    if (session->page_index >= page_count) {
        session->page_index = page_count - 1;
    }
    first_record = session->page_index * WIFI_SCAN_STATUS_LINE_COUNT;

    cyd_ui_screen_clear(screen);

    snprintf(title_line,
             sizeof(title_line),
             "%s %u/%u",
             title,
             (unsigned)(session->page_index + 1),
             (unsigned)page_count);
    cyd_ui_add_text(screen,
                    title_line,
                    WIFI_TITLE_COL,
                    WIFI_TITLE_ROW,
                    WIFI_TITLE_WIDTH_COLS,
                    WIFI_TITLE_HEIGHT_ROWS,
                    CYD_DISPLAY_ALIGN_RIGHT,
                    2,
                    CYD_UI_COLOR_YELLOW);

    if (scan_ret != ESP_OK) {
        snprintf(line_storage[0], sizeof(line_storage[0]), "scan error: %s", esp_err_to_name(scan_ret));
        cyd_ui_add_text(screen, line_storage[0], 1, 14, CYD_DISPLAY_GRID_COLS - 2, 1, CYD_DISPLAY_ALIGN_CENTER, 1, CYD_UI_COLOR_WHITE);
    } else {
        if (scanning) {
            cyd_ui_add_text(screen, "searching...", 1, 14, CYD_DISPLAY_GRID_COLS - 2, 1, CYD_DISPLAY_ALIGN_CENTER, 1, CYD_UI_COLOR_WHITE);
        } else if (session->record_count == 0) {
            cyd_ui_add_text(screen, "no AP found", 1, 14, CYD_DISPLAY_GRID_COLS - 2, 1, CYD_DISPLAY_ALIGN_CENTER, 1, CYD_UI_COLOR_WHITE);
        } else {
            size_t remaining_count = session->record_count - first_record;
            size_t count = remaining_count < WIFI_SCAN_STATUS_LINE_COUNT ? remaining_count : WIFI_SCAN_STATUS_LINE_COUNT;
            for (size_t i = 0; i < count; ++i) {
                wifi_format_scan_line(line_storage[i], sizeof(line_storage[i]), &session->records[first_record + i]);
                cyd_ui_add_button(screen,
                                line_storage[i],
                                1,
                                (uint8_t)(WIFI_SCREEN_FIRST_LINE_ROW + i * WIFI_SCREEN_LINE_HEIGHT_ROWS),
                                CYD_DISPLAY_GRID_COLS - 2,
                                WIFI_SCREEN_LINE_HEIGHT_ROWS,
                                CYD_UI_COLOR_DARKGREY,
                                CYD_UI_COLOR_LIGHTGREY,
                                (uint16_t)(WIFI_ACTION_SCAN_BASE + i));
            }
            session->visible_count = count;
        }
    }

    cyd_ui_add_button(screen,
                      "<<",
                      WIFI_BACK_COL,
                      WIFI_BACK_ROW,
                      WIFI_BACK_WIDTH_COLS,
                      WIFI_BACK_HEIGHT_ROWS,
                      CYD_UI_COLOR_BLUE,
                      CYD_UI_COLOR_CYAN,
                      WIFI_ACTION_SCAN_BACK);
    wifi_add_scan_control_button(screen, "SCAN", 1, WIFI_ACTION_SCAN_REFRESH, !scanning);
    wifi_add_scan_control_button(screen, "<", 14, WIFI_ACTION_SCAN_PREV, !scanning && session->page_index > 0);
    wifi_add_scan_control_button(screen, ">", 27, WIFI_ACTION_SCAN_NEXT, !scanning && session->page_index + 1 < page_count);

    ESP_LOGI(TAG,
             "%s refresh %" PRIu32 ": %u APs page=%u/%u",
             title,
             session->scan_round,
             (unsigned)session->record_count,
             (unsigned)(session->page_index + 1),
             (unsigned)page_count);
    return cyd_ui_submit(screen);
}

static esp_err_t wifi_refresh_scan_session(wifi_scan_session_t *session)
{
    ESP_RETURN_ON_FALSE(session != NULL, ESP_ERR_INVALID_ARG, TAG, "scan session required");

    session->visible_count = 0;
    session->record_count = 0;
    session->page_index = 0;
    ESP_RETURN_ON_ERROR(wifi_show_scan_screen("Scanning...",
                                              ESP_OK,
                                              session,
                                              true),
                        TAG,
                        "show searching failed");
    vTaskDelay(pdMS_TO_TICKS(50));

    esp_err_t scan_ret = esp32_wifi_sta_enter_scan_mode();
    if (scan_ret == ESP_OK) {
        esp_err_t records_ret = esp32_wifi_sta_get_scan_records(session->records,
                                                                WIFI_SCAN_RECORD_CAPACITY,
                                                                &session->record_count);
        if (records_ret != ESP_OK) {
            scan_ret = records_ret;
            session->record_count = 0;
        }
    }
    ESP_RETURN_ON_ERROR(wifi_show_scan_screen("Wi-Fi SSID list",
                                              scan_ret,
                                              session,
                                              false),
                        TAG,
                        "show scan list failed");
    session->scan_round++;
    return ESP_OK;
}

static void wifi_discard_pending_input(wifi_scan_session_t *session)
{
    if (session != NULL) {
        session->touch_tracker = (wifi_touch_action_tracker_t){ 0 };
    }

    (void)cyd_input_discard_pending_events();
}

static const char *wifi_keyboard_row(wifi_keyboard_page_t page, size_t row)
{
    static const char *lower_rows[] = { "qwertyuiop", "asdfghjkl", "zxcvbnm.-_" };
    static const char *upper_rows[] = { "QWERTYUIOP", "ASDFGHJKL", "ZXCVBNM.-_" };
    static const char *symbol_rows[] = { "1234567890", "~!@#$%^&*", "-_=+,.;:/?" };
    static const char *symbol_extra_rows[] = { "1234567890", "()[]{}<>|", "'\"`/" };

