katsusand/esp32_project/components/cyd_wifi_setup/cyd_wifi_setup.c
    if (row >= 3) {
        return "";
    }
    if (page == WIFI_KEYBOARD_UPPER) {
        return upper_rows[row];
    }
    if (page == WIFI_KEYBOARD_SYMBOL) {
        return symbol_rows[row];
    }
    if (page == WIFI_KEYBOARD_SYMBOL_EXTRA) {
        return symbol_extra_rows[row];
    }
    return lower_rows[row];
}

static uint8_t wifi_keyboard_row_col_offset(const char *keys, size_t row)
{
    (void)keys;
    return row == 1 ? 2 : 0;
}

static void wifi_mask_password(char *dst, size_t dst_size, const char *password)
{
    size_t password_len = password != NULL ? strlen(password) : 0;
    size_t visible_len = password_len < (dst_size - 1) ? password_len : (dst_size - 1);

    for (size_t i = 0; i < visible_len; ++i) {
        dst[i] = '*';
    }
    dst[visible_len] = '\0';
}

static esp_err_t wifi_show_password_screen(const char *ssid,
                                           const char *password,
                                           wifi_keyboard_page_t page,
                                           bool show_password)
{
    cyd_display_screen_t *screen = &s_wifi_setup_screen;
    char ssid_line[CYD_DISPLAY_TEXT_MAX_LEN + 1];
    char password_line[CYD_DISPLAY_TEXT_MAX_LEN + 1];
    char show_button_line[CYD_DISPLAY_TEXT_MAX_LEN + 1];
    char masked[WIFI_PASSWORD_MAX_LEN + 1];
    const bool symbol_page = page == WIFI_KEYBOARD_SYMBOL || page == WIFI_KEYBOARD_SYMBOL_EXTRA;
    const char *case_button_text = symbol_page ? "abc" : (page == WIFI_KEYBOARD_UPPER ? "abc" : "ABC");
    const char *symbol_button_text = page == WIFI_KEYBOARD_SYMBOL ? "()[]" : "123";
    const uint8_t row_starts[] = { WIFI_KEY_ROW_0, WIFI_KEY_ROW_1, WIFI_KEY_ROW_2 };

    snprintf(ssid_line, sizeof(ssid_line), "SSID: %.33s", ssid != NULL ? ssid : "");
    if (show_password) {
        snprintf(password_line, sizeof(password_line), "PASS: %.34s", password != NULL ? password : "");
    } else {
        wifi_mask_password(masked, sizeof(masked), password);
        snprintf(password_line, sizeof(password_line), "PASS: %.34s", masked);
    }
    snprintf(show_button_line, sizeof(show_button_line), "[%c] SHOW PASSWORD", show_password ? 'x' : ' ');
    cyd_ui_screen_clear(screen);

    cyd_ui_add_text(screen, "Wi-Fi Password", 0, 1, CYD_DISPLAY_GRID_COLS, 2, CYD_DISPLAY_ALIGN_CENTER, 2, CYD_UI_COLOR_YELLOW);
    cyd_ui_add_text(screen, ssid_line, 1, 4, CYD_DISPLAY_GRID_COLS - 2, 1, CYD_DISPLAY_ALIGN_LEFT, 1, CYD_UI_COLOR_WHITE);
    cyd_ui_add_text(screen, password_line, 1, 6, CYD_DISPLAY_GRID_COLS - 2, 1, CYD_DISPLAY_ALIGN_LEFT, 1, CYD_UI_COLOR_CYAN);
    cyd_ui_add_button(screen,
                    show_button_line,
                    1,
                    7,
                    24,
                    2,
                    show_password ? CYD_UI_COLOR_BLUE : CYD_UI_COLOR_DARKGREY,
                    CYD_UI_COLOR_LIGHTGREY,
                    WIFI_ACTION_TOGGLE_PASSWORD);

    for (size_t row = 0; row < 3; ++row) {
        const char *keys = wifi_keyboard_row(page, row);
        uint8_t col_offset = wifi_keyboard_row_col_offset(keys, row);
        for (size_t i = 0; i < strlen(keys); ++i) {
            char key_text[2] = { keys[i], '\0' };
            cyd_ui_add_button(screen,
                            key_text,
                            (uint8_t)(col_offset + i * WIFI_KEY_WIDTH_COLS),
                            row_starts[row],
                            WIFI_KEY_WIDTH_COLS,
                            WIFI_KEY_HEIGHT_ROWS,
                            CYD_UI_COLOR_DARKGREY,
                            CYD_UI_COLOR_LIGHTGREY,
                            (uint16_t)(WIFI_ACTION_KEY_BASE + (uint8_t)keys[i]));
        }
    }

    cyd_ui_add_button(screen, case_button_text, 0, WIFI_KEY_CONTROL_ROW, 8, WIFI_CONTROL_HEIGHT_ROWS, CYD_UI_COLOR_BLUE, CYD_UI_COLOR_CYAN, WIFI_ACTION_TOGGLE_CASE);
    cyd_ui_add_button(screen, symbol_button_text, 8, WIFI_KEY_CONTROL_ROW, 8, WIFI_CONTROL_HEIGHT_ROWS, CYD_UI_COLOR_BLUE, CYD_UI_COLOR_CYAN, WIFI_ACTION_SYMBOL);
    cyd_ui_add_button(screen, "DEL", 16, WIFI_KEY_CONTROL_ROW, 8, WIFI_CONTROL_HEIGHT_ROWS, CYD_UI_COLOR_RED, CYD_UI_COLOR_LIGHTGREY, WIFI_ACTION_DELETE);
    cyd_ui_add_button(screen, "SPACE", 24, WIFI_KEY_CONTROL_ROW, 16, WIFI_CONTROL_HEIGHT_ROWS, CYD_UI_COLOR_DARKGREY, CYD_UI_COLOR_LIGHTGREY, WIFI_ACTION_SPACE);
    cyd_ui_add_button(screen, "CANCEL", 1, WIFI_KEY_BOTTOM_ROW, 18, WIFI_BOTTOM_HEIGHT_ROWS, CYD_UI_COLOR_DARKGREY, CYD_UI_COLOR_LIGHTGREY, WIFI_ACTION_CANCEL);
    cyd_ui_add_button(screen, "SAVE", 21, WIFI_KEY_BOTTOM_ROW, 18, WIFI_BOTTOM_HEIGHT_ROWS, CYD_UI_COLOR_GREEN, CYD_UI_COLOR_LIGHTGREY, WIFI_ACTION_SAVE);

    return cyd_ui_submit(screen);
}

static wifi_password_key_t wifi_password_key_from_action(uint16_t action_id, wifi_keyboard_page_t page)
{
    wifi_password_key_t key = { .action = WIFI_PASSWORD_ACTION_NONE, .ch = '\0' };
    (void)page;

    switch (action_id) {
        case WIFI_ACTION_CANCEL:
            key.action = WIFI_PASSWORD_ACTION_CANCEL;
            break;
        case WIFI_ACTION_SAVE:
            key.action = WIFI_PASSWORD_ACTION_SAVE;
            break;
        case WIFI_ACTION_DELETE:
            key.action = WIFI_PASSWORD_ACTION_DELETE;
            break;
        case WIFI_ACTION_SPACE:
            key.action = WIFI_PASSWORD_ACTION_SPACE;
            break;
        case WIFI_ACTION_LOWER:
            key.action = WIFI_PASSWORD_ACTION_LOWER;
            break;
        case WIFI_ACTION_UPPER:
            key.action = WIFI_PASSWORD_ACTION_UPPER;
            break;
        case WIFI_ACTION_SYMBOL:
            key.action = WIFI_PASSWORD_ACTION_SYMBOL;
            break;
        case WIFI_ACTION_TOGGLE_PASSWORD:
            key.action = WIFI_PASSWORD_ACTION_TOGGLE_SHOW;
            break;
        case WIFI_ACTION_TOGGLE_CASE:
            key.action = WIFI_PASSWORD_ACTION_TOGGLE_CASE;
            break;
        default:
            if (action_id >= WIFI_ACTION_KEY_BASE && action_id <= WIFI_ACTION_KEY_BASE + 0x7f) {
                key.action = WIFI_PASSWORD_ACTION_CHAR;
                key.ch = (char)(action_id - WIFI_ACTION_KEY_BASE);
            }
            break;
    }
    return key;
}

