katsusand/esp32_project/components/cyd_wifi_setup/cyd_wifi_setup.c
static esp_err_t wifi_test_connect_and_save(const char *ssid, const char *password)
{
    esp32_wifi_sta_config_t config = {
        .ssid = ssid,
        .password = password,
        .max_retry = CONFIG_ESP32_WIFI_STA_MAX_RETRY,
        .authmode_threshold = WIFI_AUTH_OPEN,
        .sae_pwe_h2e = WPA3_SAE_PWE_BOTH,
        .sae_h2e_identifier = CONFIG_ESP32_WIFI_STA_SAE_H2E_IDENTIFIER,
    };

    ESP_RETURN_ON_ERROR(cyd_display_show_text("Wi-Fi", "Connecting..."), TAG, "show connecting failed");
    ESP_RETURN_ON_ERROR(esp32_wifi_sta_init_with_config(&config), TAG, "Wi-Fi config failed");
    ESP_RETURN_ON_ERROR(esp32_wifi_sta_start(), TAG, "Wi-Fi start failed");
    ESP_RETURN_ON_ERROR(esp32_wifi_sta_wait_connected(pdMS_TO_TICKS(CONFIG_ESP32_WIFI_STA_CONNECT_TIMEOUT_MS)),
                        TAG,
                        "Wi-Fi connect test failed");
    ESP_RETURN_ON_ERROR(esp32_wifi_sta_save_credentials(ssid, password), TAG, "Wi-Fi credential save failed");
    return cyd_display_show_text("Wi-Fi", "Saved");
}

static int wifi_compare_candidates(const wifi_saved_candidate_t *lhs, const wifi_saved_candidate_t *rhs)
{
    if (lhs->profile.last_success_seq != rhs->profile.last_success_seq) {
        return lhs->profile.last_success_seq > rhs->profile.last_success_seq ? -1 : 1;
    }
    if (lhs->scan_record.rssi != rhs->scan_record.rssi) {
        return lhs->scan_record.rssi > rhs->scan_record.rssi ? -1 : 1;
    }
    return strncmp(lhs->profile.ssid, rhs->profile.ssid, sizeof(lhs->profile.ssid));
}

static void wifi_sort_candidates(wifi_saved_candidate_t *candidates, size_t count)
{
    if (candidates == NULL) {
        return;
    }

    for (size_t i = 0; i < count; ++i) {
        for (size_t j = i + 1; j < count; ++j) {
            if (wifi_compare_candidates(&candidates[i], &candidates[j]) > 0) {
                wifi_saved_candidate_t tmp = candidates[i];
                candidates[i] = candidates[j];
                candidates[j] = tmp;
            }
        }
    }
}

static size_t wifi_collect_saved_candidates(wifi_saved_candidate_t *candidates,
                                            size_t candidate_capacity,
                                            esp32_wifi_sta_failure_reason_t *failure_reason)
{
    wifi_profile_store_entry_t profiles[WIFI_PROFILE_STORE_MAX_ENTRIES] = { 0 };
    esp32_wifi_sta_scan_record_t scan_records[CONFIG_ESP32_WIFI_STA_SCAN_LIST_SIZE] = { 0 };
    size_t profile_count = 0;
    size_t visible_ap_count = 0;
    size_t candidate_count = 0;

    if (failure_reason != NULL) {
        *failure_reason = ESP32_WIFI_STA_FAILURE_NONE;
    }

    if (wifi_profile_store_load_entries(profiles, WIFI_PROFILE_STORE_MAX_ENTRIES, &profile_count) != ESP_OK ||
        profile_count == 0) {
        if (failure_reason != NULL) {
            *failure_reason = ESP32_WIFI_STA_FAILURE_NO_SAVED_PROFILE;
        }
        return 0;
    }

    wifi_set_autoconnect_progress(CYD_WIFI_SETUP_AUTOCONNECT_SEARCHING, NULL);

    if (esp32_wifi_sta_enter_scan_mode() != ESP_OK ||
        esp32_wifi_sta_get_scan_records(scan_records,
                                        CONFIG_ESP32_WIFI_STA_SCAN_LIST_SIZE,
                                        &visible_ap_count) != ESP_OK) {
        if (failure_reason != NULL) {
            *failure_reason = ESP32_WIFI_STA_FAILURE_TIMEOUT;
        }
        return 0;
    }

    for (size_t i = 0; i < profile_count && candidate_count < candidate_capacity; ++i) {
        for (size_t j = 0; j < visible_ap_count; ++j) {
            if (strncmp(profiles[i].ssid, scan_records[j].ssid, sizeof(profiles[i].ssid)) != 0) {
                continue;
            }
            candidates[candidate_count].profile = profiles[i];
            candidates[candidate_count].scan_record = scan_records[j];
            ++candidate_count;
            break;
        }
    }

    wifi_sort_candidates(candidates, candidate_count);
    if (candidate_count == 0 && failure_reason != NULL) {
        *failure_reason = ESP32_WIFI_STA_FAILURE_NO_AP_IN_RANGE;
    }
    return candidate_count;
}

static esp_err_t wifi_connect_saved_candidate(const wifi_saved_candidate_t *candidate,
                                              TickType_t wait_ticks,
                                              esp32_wifi_sta_failure_reason_t *failure_reason)
{
    esp32_wifi_sta_config_t config = {
        .ssid = candidate->profile.ssid,
        .password = candidate->profile.password,
        .max_retry = CONFIG_ESP32_WIFI_STA_MAX_RETRY,
        .authmode_threshold = WIFI_AUTH_OPEN,
        .sae_pwe_h2e = WPA3_SAE_PWE_BOTH,
        .sae_h2e_identifier = CONFIG_ESP32_WIFI_STA_SAE_H2E_IDENTIFIER,
    };

    wifi_set_autoconnect_progress(CYD_WIFI_SETUP_AUTOCONNECT_TRYING, candidate->profile.ssid);

    esp_err_t err = esp32_wifi_sta_init_with_config(&config);
    if (err == ESP_OK) {
        err = esp32_wifi_sta_start();
    }
    if (err == ESP_OK && wait_ticks > 0) {
        err = esp32_wifi_sta_wait_connected(wait_ticks);
    }
    if (err == ESP_OK) {
        err = wifi_profile_store_record_success(candidate->profile.ssid,
                                                candidate->profile.password,
                                                candidate->scan_record.authmode);
    }
    if (err != ESP_OK && failure_reason != NULL) {
        *failure_reason = esp32_wifi_sta_get_last_failure_reason();
    }
    return err;
}

static void wifi_wait_ok_dialog(const char *title, const char *message)
{
    const char *lines[] = { message };
    const char *buttons[] = { "OK" };
    wifi_touch_mode_button_tracker_t touch_tracker = { 0 };

    ESP_ERROR_CHECK(cyd_display_show_mode_screen(title, lines, 1, buttons, 1, 0));
    while (true) {
        cyd_input_event_t event = { 0 };
        if (cyd_input_read_event(&event, pdMS_TO_TICKS(WIFI_IDLE_POLL_MS)) != ESP_OK) {
            if (app_shell_request_home_if_idle()) {
                return;
            }
            continue;
        }

        size_t button_index = 0;
        if (wifi_touch_event_confirmed_mode_button(&event, &touch_tracker, &button_index)) {
            return;
        }
    }
}

esp_err_t cyd_wifi_setup_connect_configured(TickType_t wait_ticks,
                                            esp32_wifi_sta_failure_reason_t *failure_reason)
{
    wifi_saved_candidate_t candidates[WIFI_PROFILE_STORE_MAX_ENTRIES] = { 0 };
    esp32_wifi_sta_failure_reason_t local_reason = ESP32_WIFI_STA_FAILURE_NONE;
    size_t candidate_count = wifi_collect_saved_candidates(candidates,
                                                           WIFI_PROFILE_STORE_MAX_ENTRIES,
                                                           &local_reason);

    if (failure_reason != NULL) {
        *failure_reason = local_reason;
    }

    if (candidate_count == 0) {
        wifi_set_autoconnect_progress(CYD_WIFI_SETUP_AUTOCONNECT_IDLE, NULL);
        return local_reason == ESP32_WIFI_STA_FAILURE_NO_SAVED_PROFILE ? ESP_ERR_NOT_FOUND : ESP_FAIL;
    }

    for (size_t i = 0; i < candidate_count; ++i) {
        esp_err_t err = wifi_connect_saved_candidate(&candidates[i], wait_ticks, &local_reason);
        if (failure_reason != NULL) {
            *failure_reason = local_reason;
        }
        if (err == ESP_OK) {
            wifi_set_autoconnect_progress(CYD_WIFI_SETUP_AUTOCONNECT_IDLE, NULL);
            return ESP_OK;
        }
    }

    wifi_set_autoconnect_progress(CYD_WIFI_SETUP_AUTOCONNECT_IDLE, NULL);
    return ESP_FAIL;
}

cyd_wifi_setup_autoconnect_progress_t cyd_wifi_setup_get_autoconnect_progress(void)
{
    cyd_wifi_setup_autoconnect_progress_t progress = { 0 };

