katsusand/esp32_project/components/cyd_wifi_setup/cyd_wifi_setup.c
    portENTER_CRITICAL(&s_autoconnect_progress_lock);
    progress = s_autoconnect_progress;
    portEXIT_CRITICAL(&s_autoconnect_progress_lock);
    return progress;
}

void cyd_wifi_setup_begin_scan_session(void)
{
    memset(&s_scan_session, 0, sizeof(s_scan_session));
    s_scan_session.initialized = true;
    (void)wifi_refresh_scan_session(&s_scan_session);
}

esp_err_t cyd_wifi_setup_poll_scan_session(const cyd_input_event_t *event,
                                           bool *selected,
                                           bool *cancelled,
                                           esp32_wifi_sta_scan_record_t *selected_record)
{
    ESP_RETURN_ON_FALSE(selected != NULL, ESP_ERR_INVALID_ARG, TAG, "selected required");
    *selected = false;
    if (cancelled != NULL) {
        *cancelled = false;
    }

    if (!s_scan_session.initialized) {
        cyd_wifi_setup_begin_scan_session();
    }

    if (event == NULL) {
        return ESP_OK;
    }

    uint16_t action_id = 0;
    if (!wifi_touch_event_confirmed_action(event, &s_scan_session.touch_tracker, &action_id)) {
        return ESP_OK;
    }

    if (action_id == WIFI_ACTION_SCAN_BACK) {
        if (cancelled != NULL) {
            *cancelled = true;
        }
        return ESP_OK;
    }

    if (action_id == WIFI_ACTION_SCAN_REFRESH) {
        ESP_RETURN_ON_ERROR(wifi_refresh_scan_session(&s_scan_session), TAG, "manual scan failed");
        wifi_discard_pending_input(&s_scan_session);
        return ESP_OK;
    }

    if (action_id == WIFI_ACTION_SCAN_PREV) {
        if (s_scan_session.page_index > 0) {
            s_scan_session.page_index--;
            ESP_RETURN_ON_ERROR(wifi_show_scan_screen("Wi-Fi SSID list", ESP_OK, &s_scan_session, false),
                                TAG,
                                "show previous scan page failed");
        }
        return ESP_OK;
    }

    if (action_id == WIFI_ACTION_SCAN_NEXT) {
        size_t page_count = wifi_scan_session_page_count(&s_scan_session);
        if (s_scan_session.page_index + 1 < page_count) {
            s_scan_session.page_index++;
            ESP_RETURN_ON_ERROR(wifi_show_scan_screen("Wi-Fi SSID list", ESP_OK, &s_scan_session, false),
                                TAG,
                                "show next scan page failed");
        }
        return ESP_OK;
    }

    if (action_id >= WIFI_ACTION_SCAN_BASE &&
        action_id < WIFI_ACTION_SCAN_BASE + s_scan_session.visible_count) {
        size_t record_index = s_scan_session.page_index * WIFI_SCAN_STATUS_LINE_COUNT +
                              (action_id - WIFI_ACTION_SCAN_BASE);
        if (selected_record != NULL) {
            *selected_record = s_scan_session.records[record_index];
        }
        *selected = true;
    }

    return ESP_OK;
}

void cyd_wifi_setup_begin_password_session(const esp32_wifi_sta_scan_record_t *record)
{
    memset(&s_password_session, 0, sizeof(s_password_session));
    s_password_session.initialized = true;
    s_password_session.page = WIFI_KEYBOARD_LOWER;
    if (record != NULL) {
        s_password_session.record = *record;
    }
    (void)wifi_show_password_screen(s_password_session.record.ssid,
                                    s_password_session.password,
                                    s_password_session.page,
                                    s_password_session.show_password);
}

esp_err_t cyd_wifi_setup_poll_password_session(const cyd_input_event_t *event,
                                               cyd_wifi_setup_password_result_t *result)
{
    ESP_RETURN_ON_FALSE(result != NULL, ESP_ERR_INVALID_ARG, TAG, "result required");
    *result = CYD_WIFI_SETUP_PASSWORD_CONTINUE;
    ESP_RETURN_ON_FALSE(s_password_session.initialized, ESP_ERR_INVALID_STATE, TAG, "password session not initialized");

    if (event == NULL) {
        return ESP_OK;
    }

    uint16_t action_id = 0;
    if (!wifi_touch_event_confirmed_action(event, &s_password_session.touch_tracker, &action_id)) {
        return ESP_OK;
    }

    wifi_password_key_t key = wifi_password_key_from_action(action_id, s_password_session.page);
    size_t password_len = strlen(s_password_session.password);

    switch (key.action) {
    case WIFI_PASSWORD_ACTION_CANCEL:
        *result = CYD_WIFI_SETUP_PASSWORD_CANCELLED;
        return ESP_OK;
    case WIFI_PASSWORD_ACTION_SAVE: {
        esp_err_t err = wifi_test_connect_and_save(s_password_session.record.ssid, s_password_session.password);
        if (err == ESP_OK) {
            vTaskDelay(pdMS_TO_TICKS(800));
            *result = CYD_WIFI_SETUP_PASSWORD_CONNECTED;
            return ESP_OK;
        }
        ESP_LOGW(TAG, "Wi-Fi SAVE failed: %s", esp_err_to_name(err));
        wifi_wait_ok_dialog("Wi-Fi Failed", esp_err_to_name(err));
        *result = CYD_WIFI_SETUP_PASSWORD_CANCELLED;
        return ESP_OK;
    }
    case WIFI_PASSWORD_ACTION_DELETE:
        if (password_len > 0) {
            s_password_session.password[password_len - 1] = '\0';
        }
        break;
    case WIFI_PASSWORD_ACTION_SPACE:
        if (password_len < WIFI_PASSWORD_MAX_LEN) {
            s_password_session.password[password_len] = ' ';
            s_password_session.password[password_len + 1] = '\0';
        }
        break;
    case WIFI_PASSWORD_ACTION_LOWER:
        s_password_session.page = WIFI_KEYBOARD_LOWER;
        break;
    case WIFI_PASSWORD_ACTION_UPPER:
        s_password_session.page = WIFI_KEYBOARD_UPPER;
        break;
    case WIFI_PASSWORD_ACTION_SYMBOL:
        s_password_session.page = s_password_session.page == WIFI_KEYBOARD_SYMBOL ? WIFI_KEYBOARD_SYMBOL_EXTRA : WIFI_KEYBOARD_SYMBOL;
        break;
    case WIFI_PASSWORD_ACTION_TOGGLE_SHOW:
        s_password_session.show_password = !s_password_session.show_password;
        break;
    case WIFI_PASSWORD_ACTION_TOGGLE_CASE:
        if (s_password_session.page == WIFI_KEYBOARD_SYMBOL || s_password_session.page == WIFI_KEYBOARD_SYMBOL_EXTRA) {
            s_password_session.page = WIFI_KEYBOARD_LOWER;
        } else {
            s_password_session.page = s_password_session.page == WIFI_KEYBOARD_UPPER ? WIFI_KEYBOARD_LOWER : WIFI_KEYBOARD_UPPER;
        }
        break;
    case WIFI_PASSWORD_ACTION_CHAR:
        if (password_len < WIFI_PASSWORD_MAX_LEN) {
            s_password_session.password[password_len] = key.ch;
            s_password_session.password[password_len + 1] = '\0';
        }
        break;
    case WIFI_PASSWORD_ACTION_NONE:
    default:
        break;
    }

    ESP_RETURN_ON_ERROR(wifi_show_password_screen(s_password_session.record.ssid,
                                                  s_password_session.password,
                                                  s_password_session.page,
                                                  s_password_session.show_password),
                        TAG,
                        "show password failed");
    return ESP_OK;
}

