katsusand/esp32_project/components/cyd_wifi_setup/cyd_wifi_setup.c
void cyd_wifi_setup_set_return_app(const app_shell_app_t *app)
{
    s_wifi_setup_return_app = app;
}

static esp_err_t cyd_wifi_setup_app_enter(void *ctx, const app_shell_app_t *from_app)
{
    (void)ctx;

    if (from_app != NULL) {
        s_wifi_setup_return_app = from_app;
    }

    if (!s_wifi_setup_app_state.active) {
        ESP_RETURN_ON_ERROR(wifi_manager_begin_setup(), TAG, "begin setup failed");
        s_wifi_setup_app_state.active = true;
    }

    s_wifi_setup_app_state.mode = CYD_WIFI_SETUP_APP_MODE_SCAN;
    memset(&s_wifi_setup_app_state.selected_record, 0, sizeof(s_wifi_setup_app_state.selected_record));
    cyd_wifi_setup_begin_scan_session();
    return ESP_OK;
}

static esp_err_t cyd_wifi_setup_app_leave(void *ctx)
{
    (void)ctx;

    if (!s_wifi_setup_app_state.active) {
        return ESP_OK;
    }

    wifi_manager_state_t state = WIFI_MANAGER_STATE_STOPPED;
    if (wifi_manager_get_state(&state) == ESP_OK && state == WIFI_MANAGER_STATE_CONNECTED) {
        s_wifi_setup_app_state.active = false;
        return ESP_OK;
    }

    ESP_RETURN_ON_ERROR(wifi_manager_complete_setup(false), TAG, "complete setup failed");
    s_wifi_setup_app_state.active = false;
    return ESP_OK;
}

static esp_err_t cyd_wifi_setup_switch_back(void)
{
    ESP_RETURN_ON_FALSE(s_wifi_setup_return_app != NULL, ESP_ERR_INVALID_STATE, TAG, "return app not set");
    return app_shell_switch_to(s_wifi_setup_return_app);
}

static esp_err_t cyd_wifi_setup_app_step(void *ctx)
{
    (void)ctx;

    if (s_wifi_setup_app_state.mode == CYD_WIFI_SETUP_APP_MODE_SCAN) {
        cyd_input_event_t event = { 0 };
        bool selected = false;
        bool cancelled = false;
        esp32_wifi_sta_scan_record_t selected_record = { 0 };

        if (cyd_input_read_event(&event, pdMS_TO_TICKS(50)) != ESP_OK) {
            return cyd_wifi_setup_poll_scan_session(NULL, &selected, &cancelled, NULL);
        }

        ESP_RETURN_ON_ERROR(cyd_wifi_setup_poll_scan_session(&event, &selected, &cancelled, &selected_record),
                            TAG,
                            "scan session failed");
        if (cancelled) {
            return cyd_wifi_setup_switch_back();
        }
        if (selected) {
            s_wifi_setup_app_state.selected_record = selected_record;
            cyd_wifi_setup_begin_password_session(&s_wifi_setup_app_state.selected_record);
            s_wifi_setup_app_state.mode = CYD_WIFI_SETUP_APP_MODE_PASSWORD;
        }
        return ESP_OK;
    }

    if (s_wifi_setup_app_state.mode == CYD_WIFI_SETUP_APP_MODE_PASSWORD) {
        cyd_input_event_t event = { 0 };
        cyd_wifi_setup_password_result_t result = CYD_WIFI_SETUP_PASSWORD_CONTINUE;

        if (cyd_input_read_event(&event, pdMS_TO_TICKS(WIFI_IDLE_POLL_MS)) != ESP_OK) {
            if (app_shell_request_home_if_idle()) {
                return ESP_OK;
            }
            return ESP_OK;
        }

        ESP_RETURN_ON_ERROR(cyd_wifi_setup_poll_password_session(&event, &result),
                            TAG,
                            "password session failed");
        if (result == CYD_WIFI_SETUP_PASSWORD_CONNECTED) {
            ESP_RETURN_ON_ERROR(wifi_manager_complete_setup(true), TAG, "complete setup failed");
            s_wifi_setup_app_state.active = false;
            time_sync_request_soon();
            return cyd_wifi_setup_switch_back();
        }
        if (result == CYD_WIFI_SETUP_PASSWORD_CANCELLED) {
            s_wifi_setup_app_state.mode = CYD_WIFI_SETUP_APP_MODE_SCAN;
            cyd_wifi_setup_begin_scan_session();
        }
    }

    return ESP_OK;
}

static const app_shell_app_t s_cyd_wifi_setup_app = {
    .id = "wifi_setup",
    .ctx = NULL,
    .enter = cyd_wifi_setup_app_enter,
    .step = cyd_wifi_setup_app_step,
    .leave = cyd_wifi_setup_app_leave,
};

const app_shell_app_t *cyd_wifi_setup_get_app(void)
{
    return &s_cyd_wifi_setup_app;
}
